results/4-loadtest/aws_results/aws_node_25.txt
Running 1m test @ https://4wr6wy8fnf.execute-api.eu-central-1.amazonaws.com/test/node_matrix
  2 threads and 25 connections
  Thread calibration: mean lat.: 57.415ms, rate sampling interval: 194ms
  Thread calibration: mean lat.: 72.564ms, rate sampling interval: 213ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    51.41ms   15.42ms 247.17ms   81.01%
    Req/Sec    12.52     23.35    62.00     78.47%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   49.22ms
 75.000%   59.20ms
 90.000%   70.59ms
 99.000%   97.98ms
 99.900%  128.96ms
 99.990%  247.29ms
 99.999%  247.29ms
100.000%  247.29ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      33.503     0.000000            1         1.00
      36.447     0.100000          127         1.11
      37.823     0.200000          253         1.25
      39.615     0.300000          377         1.43
      44.767     0.400000          500         1.67
      49.215     0.500000          627         2.00
      50.687     0.550000          687         2.22
      52.287     0.600000          749         2.50
      54.623     0.650000          814         2.86
      57.471     0.700000          875         3.33
      59.199     0.750000          936         4.00
      60.031     0.775000          968         4.44
      61.151     0.800000         1001         5.00
      62.399     0.825000         1030         5.71
      64.095     0.850000         1062         6.67
      67.967     0.875000         1092         8.00
      69.951     0.887500         1109         8.89
      70.783     0.900000         1124        10.00
      72.575     0.912500         1139        11.43
      74.879     0.925000         1156        13.33
      76.351     0.937500         1171        16.00
      77.567     0.943750         1178        17.78
      79.103     0.950000         1186        20.00
      81.599     0.956250         1194        22.86
      82.815     0.962500         1202        26.67
      83.391     0.968750         1209        32.00
      84.671     0.971875         1213        35.56
      86.015     0.975000         1217        40.00
      92.223     0.978125         1221        45.71
      95.743     0.981250         1225        53.33
      96.703     0.984375         1229        64.00
      97.343     0.985938         1233        71.11
      97.343     0.987500         1233        80.00
      97.919     0.989062         1235        91.43
      98.239     0.990625         1237       106.67
      98.559     0.992188         1240       128.00
      98.559     0.992969         1240       142.22
      98.815     0.993750         1241       160.00
      99.199     0.994531         1242       182.86
     104.511     0.995313         1243       213.33
     105.663     0.996094         1244       256.00
     105.663     0.996484         1244       284.44
     108.415     0.996875         1245       320.00
     108.415     0.997266         1245       365.71
     113.791     0.997656         1246       426.67
     113.791     0.998047         1246       512.00
     113.791     0.998242         1246       568.89
     128.959     0.998437         1247       640.00
     128.959     0.998633         1247       731.43
     128.959     0.998828         1247       853.33
     128.959     0.999023         1247      1024.00
     128.959     0.999121         1247      1137.78
     247.295     0.999219         1248      1280.00
     247.295     1.000000         1248          inf
#[Mean    =       51.412, StdDeviation   =       15.415]
#[Max     =      247.168, Total count    =         1248]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1488 requests in 1.00m, 791.95KB read
Requests/sec:     24.74
Transfer/sec:     13.17KB