results/4-loadtest/aws_results/aws_node_800.txt
Running 1m test @ https://4wr6wy8fnf.execute-api.eu-central-1.amazonaws.com/test/node_matrix
  2 threads and 800 connections
  Thread calibration: mean lat.: 344.545ms, rate sampling interval: 2533ms
  Thread calibration: mean lat.: 321.486ms, rate sampling interval: 2328ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    58.01ms   42.69ms 624.64ms   96.05%
    Req/Sec   401.11     40.73   497.00     63.16%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   50.88ms
 75.000%   61.98ms
 90.000%   75.97ms
 99.000%  174.72ms
 99.900%  528.38ms
 99.990%  598.53ms
 99.999%  625.15ms
100.000%  625.15ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      32.063     0.000000            1         1.00
      37.695     0.100000         3867         1.11
      39.423     0.200000         7731         1.25
      41.919     0.300000        11516         1.43
      46.783     0.400000        15359         1.67
      50.879     0.500000        19203         2.00
      52.383     0.550000        21122         2.22
      54.335     0.600000        23042         2.50
      57.087     0.650000        24958         2.86
      59.743     0.700000        26878         3.33
      61.983     0.750000        28803         4.00
      63.231     0.775000        29766         4.44
      64.703     0.800000        30711         5.00
      66.495     0.825000        31670         5.71
      68.991     0.850000        32647         6.67
      72.575     0.875000        33597         8.00
      74.431     0.887500        34075         8.89
      75.967     0.900000        34560        10.00
      77.375     0.912500        35028        11.43
      80.319     0.925000        35511        13.33
      84.095     0.937500        35991        16.00
      87.103     0.943750        36228        17.78
      91.519     0.950000        36469        20.00
      95.935     0.956250        36708        22.86
     104.255     0.962500        36947        26.67
     111.103     0.968750        37187        32.00
     114.239     0.971875        37309        35.56
     123.327     0.975000        37429        40.00
     130.303     0.978125        37549        45.71
     137.727     0.981250        37667        53.33
     149.375     0.984375        37787        64.00
     155.391     0.985938        37847        71.11
     165.119     0.987500        37907        80.00
     170.495     0.989062        37967        91.43
     183.039     0.990625        38027       106.67
     276.479     0.992188        38087       128.00
     320.767     0.992969        38117       142.22
     418.815     0.993750        38147       160.00
     491.263     0.994531        38177       182.86
     498.687     0.995313        38208       213.33
     501.247     0.996094        38237       256.00
     513.279     0.996484        38252       284.44
     514.815     0.996875        38269       320.00
     515.839     0.997266        38282       365.71
     517.887     0.997656        38298       426.67
     521.983     0.998047        38312       512.00
     522.751     0.998242        38320       568.89
     524.799     0.998437        38332       640.00
     525.311     0.998633        38334       731.43
     527.359     0.998828        38343       853.33
     528.383     0.999023        38349      1024.00
     530.943     0.999121        38355      1137.78
     531.967     0.999219        38361      1280.00
     531.967     0.999316        38361      1462.86
     535.551     0.999414        38364      1706.67
     545.279     0.999512        38370      2048.00
     545.279     0.999561        38370      2275.56
     555.007     0.999609        38372      2560.00
     558.591     0.999658        38373      2925.71
     571.391     0.999707        38375      3413.33
     577.535     0.999756        38377      4096.00
     578.559     0.999780        38378      4551.11
     580.607     0.999805        38379      5120.00
     582.655     0.999829        38380      5851.43
     588.287     0.999854        38381      6826.67
     598.527     0.999878        38382      8192.00
     598.527     0.999890        38382      9102.22
     601.087     0.999902        38383     10240.00
     601.087     0.999915        38383     11702.86
     603.135     0.999927        38384     13653.33
     603.135     0.999939        38384     16384.00
     603.135     0.999945        38384     18204.44
     621.055     0.999951        38385     20480.00
     621.055     0.999957        38385     23405.71
     621.055     0.999963        38385     27306.67
     621.055     0.999969        38385     32768.00
     621.055     0.999973        38385     36408.89
     625.151     0.999976        38386     40960.00
     625.151     1.000000        38386          inf
#[Mean    =       58.015, StdDeviation   =       42.692]
#[Max     =      624.640, Total count    =        38386]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  47173 requests in 1.00m, 24.52MB read
  Socket errors: connect 0, read 0, write 0, timeout 14
Requests/sec:    786.17
Transfer/sec:    418.42KB