results/4-loadtest/aws_results/aws_python_400.txt
Running 1m test @ https://rpyfifab72.execute-api.eu-central-1.amazonaws.com/test/python_matrix
  2 threads and 400 connections
  Thread calibration: mean lat.: 325.094ms, rate sampling interval: 1431ms
  Thread calibration: mean lat.: 339.998ms, rate sampling interval: 1399ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   257.37ms   20.35ms 791.55ms   86.54%
    Req/Sec   200.10     66.34   285.00     60.29%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  257.28ms
 75.000%  264.45ms
 90.000%  276.22ms
 99.000%  298.75ms
 99.900%  337.15ms
 99.990%  792.06ms
 99.999%  792.06ms
100.000%  792.06ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     226.175     0.000000            1         1.00
     239.359     0.100000         2010         1.11
     243.327     0.200000         3995         1.25
     247.935     0.300000         5881         1.43
     252.671     0.400000         7851         1.67
     257.279     0.500000         9878         2.00
     258.815     0.550000        10855         2.22
     260.095     0.600000        11872         2.50
     261.375     0.650000        12816         2.86
     262.655     0.700000        13749         3.33
     264.447     0.750000        14735         4.00
     265.215     0.775000        15222         4.44
     266.495     0.800000        15702         5.00
     268.287     0.825000        16197         5.71
     271.615     0.850000        16686         6.67
     274.431     0.875000        17197         8.00
     275.199     0.887500        17420         8.89
     276.223     0.900000        17689        10.00
     277.247     0.912500        17903        11.43
     278.271     0.925000        18167        13.33
     280.319     0.937500        18386        16.00
     282.111     0.943750        18508        17.78
     285.183     0.950000        18627        20.00
     288.511     0.956250        18748        22.86
     289.791     0.962500        18876        26.67
     290.559     0.968750        18999        32.00
     291.071     0.971875        19050        35.56
     291.839     0.975000        19128        40.00
     292.351     0.978125        19191        45.71
     292.863     0.981250        19247        53.33
     293.631     0.984375        19295        64.00
     294.655     0.985938        19331        71.11
     295.679     0.987500        19356        80.00
     297.727     0.989062        19388        91.43
     300.287     0.990625        19418       106.67
     301.823     0.992188        19452       128.00
     302.335     0.992969        19463       142.22
     302.847     0.993750        19478       160.00
     303.359     0.994531        19493       182.86
     304.127     0.995313        19509       213.33
     305.663     0.996094        19527       256.00
     306.175     0.996484        19535       284.44
     306.943     0.996875        19541       320.00
     307.455     0.997266        19547       365.71
     313.087     0.997656        19556       426.67
     320.767     0.998047        19563       512.00
     321.791     0.998242        19566       568.89
     325.375     0.998437        19570       640.00
     327.167     0.998633        19575       731.43
     334.079     0.998828        19578       853.33
     337.151     0.999023        19581      1024.00
     347.903     0.999121        19583      1137.78
     364.543     0.999219        19585      1280.00
     763.391     0.999316        19588      1462.86
     763.903     0.999414        19592      1706.67
     763.903     0.999512        19592      2048.00
     763.903     0.999561        19592      2275.56
     764.415     0.999609        19594      2560.00
     764.415     0.999658        19594      2925.71
     764.927     0.999707        19595      3413.33
     765.439     0.999756        19596      4096.00
     765.439     0.999780        19596      4551.11
     790.015     0.999805        19597      5120.00
     790.015     0.999829        19597      5851.43
     792.063     0.999854        19600      6826.67
     792.063     1.000000        19600          inf
#[Mean    =      257.372, StdDeviation   =       20.346]
#[Max     =      791.552, Total count    =        19600]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  23603 requests in 1.00m, 12.40MB read
Requests/sec:    391.83
Transfer/sec:    210.84KB